librbd_iscsi/yujiang/write/logs/fio-8k.fio.log
write-8k: (g=0): rw=write, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;write-8k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;4936128;8226;1028;600012;1;545;6.787217;4.287604;1579;1327488;15551.365454;24945.879662;1.000000%=3260;5.000000%=5472;10.000000%=7634;20.000000%=9371;30.000000%=10289;40.000000%=10944;50.000000%=11599;60.000000%=12386;70.000000%=13697;80.000000%=16580;90.000000%=22151;95.000000%=28704;99.000000%=99090;99.500000%=154140;99.900000%=408944;99.950000%=501219;99.990000%=599785;0%=0;0%=0;0%=0;1590;1327493;15558.152671;24945.874739;16;11664;100.000000%;8240.886477;3147.031430;32.949896%;66.685944%;481316;0;5136;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.04%;2.18%;24.73%;59.61%;11.35%;1.10%;0.73%;0.20%;0.05%;0.01%;0.01%;0.00%;sda;0;16389;0;11775;0;242784;242788;1.07%;"write test with block size of 8k"

write-8k: (groupid=0, jobs=1): err= 0: pid=3233219: Thu May 21 06:15:24 2020
  Description  : ["write test with block size of 8k"]
  write: IOPS=1028, BW=8227KiB/s (8424kB/s)(4820MiB/600012msec)
    slat (nsec): min=1457, max=545190, avg=6787.22, stdev=4287.60
    clat (usec): min=1579, max=1327.5k, avg=15551.37, stdev=24945.88
     lat (usec): min=1590, max=1327.5k, avg=15558.15, stdev=24945.87
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    6], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   11], 40.00th=[   11], 50.00th=[   12], 60.00th=[   13],
     | 70.00th=[   14], 80.00th=[   17], 90.00th=[   23], 95.00th=[   29],
     | 99.00th=[  100], 99.50th=[  155], 99.90th=[  409], 99.95th=[  502],
     | 99.99th=[  600]
   bw (  KiB/s): min=   16, max=11664, per=100.00%, avg=8240.89, stdev=3147.03, samples=1198
   iops        : min=    2, max= 1458, avg=1030.09, stdev=393.38, samples=1198
  lat (msec)   : 2=0.04%, 4=2.18%, 10=24.73%, 20=59.61%, 50=11.35%
  lat (msec)   : 100=1.10%, 250=0.73%, 500=0.20%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=32.95%, sys=66.69%, ctx=481316, majf=0, minf=5136
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,617016,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=8227KiB/s (8424kB/s), 8227KiB/s-8227KiB/s (8424kB/s-8424kB/s), io=4820MiB (5055MB), run=600012-600012msec

Disk stats (read/write):
  sda: ios=0/16389, merge=0/11775, ticks=0/242784, in_queue=242788, util=1.07%