librbd_iscsi/yujiang/write/logs/fio-iscsi-1m.fio.log
lv0: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;50128896;83498;81;600354;33;2830;140.942012;49.188305;19508;2282978;196064.999151;213384.425619;1.000000%=32899;5.000000%=40108;10.000000%=45875;20.000000%=52690;30.000000%=60030;40.000000%=72876;50.000000%=89653;60.000000%=115867;70.000000%=191889;80.000000%=367001;90.000000%=541065;95.000000%=658505;99.000000%=851443;99.500000%=926941;99.900000%=1233125;99.950000%=1568669;99.990000%=2164260;0%=0;0%=0;0%=0;19644;2283107;196206.612683;213385.692946;2048;337920;100.000000%;84001.841576;66486.673174;0.738899%;0.591985%;48403;0;8221;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;15.37%;39.35%;18.87%;13.89%;10.16%;2.07%;0.26%;0.03%

lv0: (groupid=0, jobs=1): err= 0: pid=3429764: Thu May 21 07:55:49 2020
  write: IOPS=81, BW=81.5MiB/s (85.5MB/s)(47.8GiB/600354msec)
    slat (usec): min=33, max=2830, avg=140.94, stdev=49.19
    clat (msec): min=19, max=2282, avg=196.06, stdev=213.38
     lat (msec): min=19, max=2283, avg=196.21, stdev=213.39
    clat percentiles (msec):
     |  1.00th=[   33],  5.00th=[   41], 10.00th=[   46], 20.00th=[   53],
     | 30.00th=[   61], 40.00th=[   73], 50.00th=[   90], 60.00th=[  116],
     | 70.00th=[  192], 80.00th=[  368], 90.00th=[  542], 95.00th=[  659],
     | 99.00th=[  852], 99.50th=[  927], 99.90th=[ 1234], 99.95th=[ 1569],
     | 99.99th=[ 2165]
   bw (  KiB/s): min= 2048, max=337920, per=100.00%, avg=84001.84, stdev=66486.67, samples=1193
   iops        : min=    2, max=  330, avg=81.99, stdev=64.94, samples=1193
  lat (msec)   : 20=0.01%, 50=15.37%, 100=39.35%, 250=18.87%, 500=13.89%
  lat (msec)   : 750=10.16%, 1000=2.07%, 2000=0.26%, >=2000=0.03%
  cpu          : usr=0.74%, sys=0.59%, ctx=48403, majf=0, minf=8221
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,48954,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=81.5MiB/s (85.5MB/s), 81.5MiB/s-81.5MiB/s (85.5MB/s-85.5MB/s), io=47.8GiB (51.3GB), run=600354-600354msec