librbd_iscsi/yujiang/write/logs/fio-iscsi-4k.fio.log
lv0: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8153572;13589;3397;600003;1;3954;8.764918;7.095505;1031;1444751;4698.938108;11368.901929;1.000000%=1810;5.000000%=2179;10.000000%=2375;20.000000%=2637;30.000000%=2834;40.000000%=3031;50.000000%=3260;60.000000%=3489;70.000000%=3817;80.000000%=4358;90.000000%=6324;95.000000%=12648;99.000000%=20840;99.500000%=47448;99.900000%=123207;99.950000%=227540;99.990000%=434110;0%=0;0%=0;0%=0;1038;1444754;4707.962897;11368.905239;112;21109;100.000000%;13610.257095;4322.806702;1.404662%;4.493818%;1392014;0;36;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;2.46%;71.86%;18.75%;5.86%;0.59%;0.36%;0.08%;0.04%;0.01%;0.00%;0.01%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3372288: Thu May 21 07:25:46 2020
  write: IOPS=3397, BW=13.3MiB/s (13.9MB/s)(7962MiB/600003msec)
    slat (nsec): min=1618, max=3954.2k, avg=8764.92, stdev=7095.51
    clat (usec): min=1031, max=1444.8k, avg=4698.94, stdev=11368.90
     lat (usec): min=1038, max=1444.8k, avg=4707.96, stdev=11368.91
    clat percentiles (usec):
     |  1.00th=[  1811],  5.00th=[  2180], 10.00th=[  2376], 20.00th=[  2638],
     | 30.00th=[  2835], 40.00th=[  3032], 50.00th=[  3261], 60.00th=[  3490],
     | 70.00th=[  3818], 80.00th=[  4359], 90.00th=[  6325], 95.00th=[ 12649],
     | 99.00th=[ 20841], 99.50th=[ 47449], 99.90th=[123208], 99.95th=[227541],
     | 99.99th=[434111]
   bw (  KiB/s): min=  112, max=21109, per=100.00%, avg=13610.26, stdev=4322.81, samples=1198
   iops        : min=   28, max= 5277, avg=3402.54, stdev=1080.70, samples=1198
  lat (msec)   : 2=2.46%, 4=71.86%, 10=18.75%, 20=5.86%, 50=0.59%
  lat (msec)   : 100=0.36%, 250=0.08%, 500=0.04%, 750=0.01%, 2000=0.01%
  cpu          : usr=1.40%, sys=4.49%, ctx=1392014, majf=0, minf=36
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2038393,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=13.3MiB/s (13.9MB/s), 13.3MiB/s-13.3MiB/s (13.9MB/s-13.9MB/s), io=7962MiB (8349MB), run=600003-600003msec