librbd_iscsi/yujiang/write/logs/fio-iscsi-4m.fio.log
lv0: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;92733440;154299;37;600998;168;2439;485.742605;118.765367;43139;3073805;424199.113522;356498.662506;1.000000%=181403;5.000000%=189792;10.000000%=196083;20.000000%=202375;30.000000%=210763;40.000000%=217055;50.000000%=229638;60.000000%=250609;70.000000%=387973;80.000000%=725614;90.000000%=935329;95.000000%=1199570;99.000000%=1602224;99.500000%=1853882;99.900000%=2139095;99.950000%=2365587;99.990000%=2835349;0%=0;0%=0;0%=0;43307;3074151;424685.798107;356505.180532;8175;360448;100.000000%;156992.550761;108763.201353;1.217311%;0.713814%;23354;0;14;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;0.01%;59.94%;11.60%;10.24%;9.70%;8.29%;0.21%

lv0: (groupid=0, jobs=1): err= 0: pid=3451805: Thu May 21 08:05:51 2020
  write: IOPS=37, BW=151MiB/s (158MB/s)(88.4GiB/600998msec)
    slat (usec): min=168, max=2439, avg=485.74, stdev=118.77
    clat (msec): min=43, max=3073, avg=424.20, stdev=356.50
     lat (msec): min=43, max=3074, avg=424.69, stdev=356.51
    clat percentiles (msec):
     |  1.00th=[  182],  5.00th=[  190], 10.00th=[  197], 20.00th=[  203],
     | 30.00th=[  211], 40.00th=[  218], 50.00th=[  230], 60.00th=[  251],
     | 70.00th=[  388], 80.00th=[  726], 90.00th=[  936], 95.00th=[ 1200],
     | 99.00th=[ 1603], 99.50th=[ 1854], 99.90th=[ 2140], 99.95th=[ 2366],
     | 99.99th=[ 2836]
   bw (  KiB/s): min= 8175, max=360448, per=100.00%, avg=156992.55, stdev=108763.20, samples=1182
   iops        : min=    1, max=   88, avg=38.23, stdev=26.54, samples=1182
  lat (msec)   : 50=0.01%, 100=0.01%, 250=59.94%, 500=11.60%, 750=10.24%
  lat (msec)   : 1000=9.70%, 2000=8.29%, >=2000=0.21%
  cpu          : usr=1.22%, sys=0.71%, ctx=23354, majf=0, minf=14
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,22640,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=151MiB/s (158MB/s), 151MiB/s-151MiB/s (158MB/s-158MB/s), io=88.4GiB (94.0GB), run=600998-600998msec