librbd_iscsi/yujiang/write/logs/fio-iscsi-64k.fio.log
lv0: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;lv0;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;57811008;96350;1505;600010;3;541;16.553144;10.522559;2036;1719504;10608.910175;17554.374518;1.000000%=3325;5.000000%=4489;10.000000%=5210;20.000000%=6258;30.000000%=7045;40.000000%=7831;50.000000%=8716;60.000000%=9633;70.000000%=10944;80.000000%=13041;90.000000%=16580;95.000000%=19005;99.000000%=33161;99.500000%=43253;99.900000%=204472;99.950000%=304087;99.990000%=759169;0%=0;0%=0;0%=0;2068;1719513;10625.782552;17554.159716;2048;127616;100.000000%;97232.554247;21510.963650;1.076984%;2.890457%;469714;0;278;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;2.88%;60.06%;33.38%;3.25%;0.16%;0.20%;0.06%;0.01%;0.01%;0.01%;0.00%

lv0: (groupid=0, jobs=1): err= 0: pid=3410832: Thu May 21 07:45:48 2020
  write: IOPS=1505, BW=94.1MiB/s (98.7MB/s)(55.1GiB/600010msec)
    slat (usec): min=3, max=541, avg=16.55, stdev=10.52
    clat (msec): min=2, max=1719, avg=10.61, stdev=17.55
     lat (msec): min=2, max=1719, avg=10.63, stdev=17.55
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    6], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    9], 60.00th=[   10],
     | 70.00th=[   11], 80.00th=[   14], 90.00th=[   17], 95.00th=[   20],
     | 99.00th=[   34], 99.50th=[   44], 99.90th=[  205], 99.95th=[  305],
     | 99.99th=[  760]
   bw (  KiB/s): min= 2048, max=127616, per=100.00%, avg=97232.55, stdev=21510.96, samples=1189
   iops        : min=   32, max= 1994, avg=1519.24, stdev=336.11, samples=1189
  lat (msec)   : 4=2.88%, 10=60.06%, 20=33.38%, 50=3.25%, 100=0.16%
  lat (msec)   : 250=0.20%, 500=0.06%, 750=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=1.08%, sys=2.89%, ctx=469714, majf=0, minf=278
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,903297,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=94.1MiB/s (98.7MB/s), 94.1MiB/s-94.1MiB/s (98.7MB/s-98.7MB/s), io=55.1GiB (59.2GB), run=600010-600010msec